app/controllers/carts_controller.rb

  def show
    begin
      @cart = Cart.find(params[:id])
---
SELECT  `carts`.* FROM `carts`  WHERE `carts`.`id` = 980190962 LIMIT 1

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2015-01-12 13:08:34', '2015-01-12 13:08:34')

  def destroy
    @cart = current_cart
    @cart.destroy
---
DELETE FROM `carts` WHERE `carts`.`id` = 980190962

    def set_cart
      begin
        @cart = Cart.find(params[:id])
---
SELECT  `carts`.* FROM `carts`  WHERE `carts`.`id` = 980190962 LIMIT 1