app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    quantity = params[:quantity].to_i


    id = params[:product_id]
    product = Product.find(id)
    @line_item = @cart.add_product(product.id, quantity )

    respond_to do |format|
      if @line_item.save
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2015-01-12 13:10:20', '2015-01-12 13:10:20')

  def destroy
    @line_item.destroy
---
DELETE FROM `line_items` WHERE `line_items`.`id` = 980190962

    def set_line_item
      @line_item = LineItem.find(params[:id])
---
SELECT  `line_items`.* FROM `line_items`  WHERE `line_items`.`id` = 980190962 LIMIT 1