app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`created_at`, `description`, `detail_image_url_1`, `detail_image_url_2`, `detail_image_url_3`, `detail_image_url_4`, `detail_image_url_5`, `detail_text_1`, `detail_text_2`, `detail_text_3`, `detail_text_4`, `detail_text_5`, `image_url`, `price`, `title`, `updated_at`) VALUES ('2015-01-12 06:08:52', 'MyText', 'MyString', 'MyString', 'MyString', 'MyString', 'MyString', 'MyText', 'MyText', 'MyText', 'MyText', 'MyText', 'MyString', 10, 'MyString', '2015-01-12 06:08:52')

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `description` = '因果实鲜红漂亮而得名。具有叶绿、花白、果红、味佳的品质，极品红颜特点是个大、色红、味甜。', `image_url` = 'hongyan-235150.jpg', `price` = 49, `title` = '红颜草莓', `updated_at` = '2015-01-12 08:04:12' WHERE `products`.`id` = 980190962