app/controllers/store_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    # 应用了分页插件
    @products = Product.order('id').page(params[:page]).per(20)
    @cart = current_cart

    @buy_quantity = Hash.new

    @line_items = @cart.line_items

    @products.each do |product|